# Dog DNA

In [1]:
from datetime import datetime
start_time = datetime.now()

In [2]:
import pandas as pd

In [3]:
FILE_RAW = 'dog_dna.csv'
USECOLS = ['Dog 1 A', 'Dog 1 G', 'Dog 2 A', 'Dog 2 G']

In [4]:
df = pd.read_csv(FILE_RAW, usecols=USECOLS)

In [5]:
df.head()

  Dog 1 A Dog 1 G Dog 2 A Dog 2 G
0       A       A       A       A
1       A       A       A       A
2       G       G       G       G
3       A       A       A       A
4       G       A       G       G

In [6]:
df['Dog1'] = df['Dog 1 A'] + df['Dog 1 G']
df['Dog2'] = df['Dog 2 A'] + df['Dog 2 G']
df.head()

  Dog 1 A Dog 1 G Dog 2 A Dog 2 G Dog1 Dog2
0       A       A       A       A   AA   AA
1       A       A       A       A   AA   AA
2       G       G       G       G   GG   GG
3       A       A       A       A   AA   AA
4       G       A       G       G   GA   GG

In [7]:
pd.crosstab(df['Dog 1 A'], df['Dog 1 G'])

Dog 1 G    0      A      C    D      G    I     T
Dog 1 A
0        607      0      0    0      0    0     0
A          0  73718   2938    0  12541    0   613
C          0   3256  19821    0    597    0     0
D          0      0      0  307      0   63     0
G          0  16611    647    0  78877    0     0
I          0      0      0   88      0  433     0
T          0    667      0    0      0    0  3222

In [8]:
pd.crosstab(df['Dog 1 A'], df['Dog 1 G'],
            margins=True,
            margins_name='Total',
            dropna=True)

Dog 1 G    0      A      C    D      G    I     T   Total
Dog 1 A
0        607      0      0    0      0    0     0     607
A          0  73718   2938    0  12541    0   613   89810
C          0   3256  19821    0    597    0     0   23674
D          0      0      0  307      0   63     0     370
G          0  16611    647    0  78877    0     0   96135
I          0      0      0   88      0  433     0     521
T          0    667      0    0      0    0  3222    3889
Total    607  94252  23406  395  92015  496  3835  215006

In [9]:
pd.crosstab(df['Dog 1 A'], df['Dog 1 G'],
            margins=True,
            margins_name='Total',
            dropna=True,
            normalize=True).round(4)*100

Dog 1 G     0      A      C     D      G     I     T   Total
Dog 1 A
0        0.28   0.00   0.00  0.00   0.00  0.00  0.00    0.28
A        0.00  34.29   1.37  0.00   5.83  0.00  0.29   41.77
C        0.00   1.51   9.22  0.00   0.28  0.00  0.00   11.01
D        0.00   0.00   0.00  0.14   0.00  0.03  0.00    0.17
G        0.00   7.73   0.30  0.00  36.69  0.00  0.00   44.71
I        0.00   0.00   0.00  0.04   0.00  0.20  0.00    0.24
T        0.00   0.31   0.00  0.00   0.00  0.00  1.50    1.81
Total    0.28  43.84  10.89  0.18  42.80  0.23  1.78  100.00

In [10]:
end_time = datetime.now()
(end_time - start_time).total_seconds()

0.956391